{
  "backend/main.mo": "Motoko backend handling online admissions and inquiries with admin-gated retrieval and blob storage integration.",
  "feature_evidence.json": "Feature evidence report linking copy‑link functionality to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing all major frontend pages, components, and styles.",
  "frontend/index.css": "Tailwind CSS base theme defining light/dark OKLCH color variables and global styling.",
  "frontend/index.html": "Main HTML entry setting metadata, SEO tags, favicon, and mounting the React app.",
  "frontend/src/App.tsx": "React router configuration defining all site routes wrapped in theme and layout providers.",
  "frontend/src/components/admin/AdminGate.tsx": "Component that checks Internet Identity and admin permission before rendering protected content.",
  "frontend/src/components/admin/CsvExportButton.tsx": "Button component generating CSV downloads for admissions or inquiries.",
  "frontend/src/components/auth/LoginButton.tsx": "Internet Identity login/logout button with loading state and session clearing.",
  "frontend/src/components/facilities/FacilityIconCard.tsx": "Reusable card displaying a facility icon, name, and description.",
  "frontend/src/components/forms/InquiryForm.tsx": "Form for submitting inquiries with validation, service selection, and async submission via useSubmitInquiry.",
  "frontend/src/components/forms/OnlineAdmissionForm.tsx": "Online admission form handling personal details, address, package selection, photo upload, and submission via useSubmitAdmission.",
  "frontend/src/components/gallery/LightboxSlider.tsx": "Modal lightbox allowing image navigation with keyboard support and UI controls.",
  "frontend/src/components/home/HeroMedia.tsx": "Hero background component showing a looping video with a fallback image on error.",
  "frontend/src/components/layout/CopyLinkButton.tsx": "Button that copies the current page link and displays success or error status icons.",
  "frontend/src/components/layout/Footer.tsx": "Footer with about info, quick links, services, and contact details including social icons.",
  "frontend/src/components/layout/HeaderNav.tsx": "Responsive site header with navigation links, copy-link button, call-to-action buttons, and mobile menu.",
  "frontend/src/components/layout/SiteLayout.tsx": "Page layout wrapper containing header, footer, and main content area.",
  "frontend/src/components/membership/PricingCard.tsx": "Pricing card displaying plan details, features, and a button to start admission.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance tied to the current identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAdmissions.ts": "Provides React Query hooks to submit admissions and inquiries and fetch all admissions, inquiries, and admin status via the actor.",
  "frontend/src/hooks/useCopyPageLink.ts": "Implements a utility hook to copy the current page URL using clipboard APIs with fallback behavior.",
  "frontend/src/hooks/useInquiries.ts": "Defines a React Query mutation hook for submitting inquiries through the actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook to manage authentication, identity loading, and login state via AuthClient.",
  "frontend/src/index.css": "Defines Tailwind base styles and luxury-themed color variables, typography, and UI effects for the app.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider, rendering the root App component.",
  "frontend/src/pages/AdminPage.tsx": "Renders the admin dashboard with stats, search, tabs, and tables for managing admissions and inquiries.",
  "frontend/src/pages/ContactPage.tsx": "Displays contact details, phone links, map embeds, and quick-action buttons for calling or messaging the gym.",
  "frontend/src/pages/ExtraPremiumFacilitiesPage.tsx": "Displays a grid of premium facility cards using predefined data with icons, names, and descriptions.",
  "frontend/src/pages/GalleryPage.tsx": "Renders a tabbed gallery with category filters, placeholder images, and a lightbox viewer.",
  "frontend/src/pages/GymFacilitiesPage.tsx": "Shows a grid of gym facility cards based on a facility list with icons and descriptions.",
  "frontend/src/pages/HomePage.tsx": "Provides a hero section with navigation buttons and SEO-focused content highlighting gym features.",
  "frontend/src/pages/InquiryPage.tsx": "Handles inquiry form submission and displays a success screen with WhatsApp link integration.",
  "frontend/src/pages/MassageTherapyPage.tsx": "Presents massage and therapy services with descriptions and actions to book or call.",
  "frontend/src/pages/MembershipPlansPage.tsx": "Displays individual, couple, and group membership plans using pricing cards and feature lists.",
  "frontend/src/pages/OnlineAdmissionPage.tsx": "Renders the online admission form and shows a success screen after submission with navigation options. Uses state to toggle between form and confirmation view.",
  "frontend/src/pages/RestaurantCoffeePage.tsx": "Displays restaurant and coffee offerings as cards and includes a placeholder gallery grid. Uses predefined items with icons and descriptions.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, storing, persisting, and clearing URL or session-based parameters. Supports both query and hash routing formats.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, animations, fonts, and custom gold-themed styles for the luxury UI. Extends base utilities and enables plugins.",
  "project_state.json": "Stores project metadata, feature descriptions, requirements tracking, and architectural notes for the site’s development state."
}