{
  "backend/main.mo": "Motoko canister handling online admissions and inquiries with ID generation, storage maps, and admin‑protected getters backed by authorization and blob‑storage mixins.",
  "feature_evidence.json": "Feature evidence listing required files, components, and test IDs for adding a Google Business Profile link and LocalBusiness JSON‑LD.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files describing styling, pages, components, and recent SEO/GBP additions.",
  "frontend/index.css": "Tailwind base layer defining OKLCH design tokens for light/dark themes and applying global background and border utilities.",
  "frontend/index.html": "Main HTML entry including SEO meta tags and LocalBusiness JSON-LD with NAP details and Google Business Profile URL.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes for all site pages inside a themed SiteLayout.",
  "frontend/src/components/admin/AdminGate.tsx": "Admin access wrapper that checks Internet Identity and admin status, gating protected content with loading, login, or denial states.",
  "frontend/src/components/admin/CsvExportButton.tsx": "Exports admissions or inquiries data to a CSV file using a generated Blob and download link.",
  "frontend/src/components/auth/LoginButton.tsx": "Handles login/logout via Internet Identity and updates UI based on authentication and loading state.",
  "frontend/src/components/facilities/FacilityIconCard.tsx": "Displays a facility card with an icon, title, and description.",
  "frontend/src/components/forms/InquiryForm.tsx": "Form for submitting inquiries with validation, service selection, and mutation handling.",
  "frontend/src/components/forms/OnlineAdmissionForm.tsx": "Admission form with photo upload, validation, and submission to the backend.",
  "frontend/src/components/gallery/LightboxSlider.tsx": "Lightbox modal supporting image navigation, keyboard controls, and display of current index.",
  "frontend/src/components/home/HeroMedia.tsx": "Renders a looping hero video with fallback background image on error.",
  "frontend/src/components/layout/CopyLinkButton.tsx": "Button that copies the current page link and updates icon and label based on copy status.",
  "frontend/src/components/layout/Footer.tsx": "Footer with social links, navigation links, services, and contact information.",
  "frontend/src/components/layout/HeaderNav.tsx": "Responsive site header with logo, navigation links, CTAs, and a mobile sheet menu.",
  "frontend/src/components/layout/SiteLayout.tsx": "Page wrapper providing the header, footer, and main content layout.",
  "frontend/src/components/membership/PricingCard.tsx": "Pricing card component showing plan details, features, and a CTA to start admission.",
  "frontend/src/constants/branding.ts": "Centralized branding config defining logo and favicon asset paths.",
  "frontend/src/constants/contact.ts": "Defines approved contact numbers and utilities for tel, WhatsApp, and display formatting.",
  "frontend/src/constants/googleBusinessProfile.ts": "Stores the Google Business Profile link and display label.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor with reactive identity handling.",
  "frontend/src/hooks/useAdmissions.ts": "Provides mutations and queries for submitting and fetching admissions and inquiries, plus admin checks.",
  "frontend/src/hooks/useCopyPageLink.ts": "Hook to copy the current page URL using the clipboard API with fallbacks.",
  "frontend/src/hooks/useInquiries.ts": "Mutation hook for submitting inquiries and invalidating related queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider managing Internet Identity login, stored identity loading, and status tracking.",
  "frontend/src/index.css": "Tailwind setup with luxury black‑and‑gold theme variables, marble backgrounds, and custom utility classes.",
  "frontend/src/main.tsx": "App entry point initializing React, QueryClient, InternetIdentityProvider, and global styles.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard showing admissions and inquiries with search, stats, tabs, and CSV export.",
  "frontend/src/pages/ContactPage.tsx": "Displays address, phone, action buttons, and Google Maps embed for contacting the gym.",
  "frontend/src/pages/ExtraPremiumFacilitiesPage.tsx": "Lists premium facility cards with icons and descriptions.",
  "frontend/src/pages/GalleryPage.tsx": "Gallery with category tabs, placeholder images, and a lightbox viewer.",
  "frontend/src/pages/GymFacilitiesPage.tsx": "Shows a grid of gym facilities using icon cards with descriptions.",
  "frontend/src/pages/HomePage.tsx": "Hero landing page with branding and navigation buttons plus SEO content sections.",
  "frontend/src/pages/InquiryPage.tsx": "Inquiry form page that shows a success message and WhatsApp link after submission.",
  "frontend/src/pages/MassageTherapyPage.tsx": "Displays a massage services page with a grid of therapy offerings and a call-to-action section for booking by phone.",
  "frontend/src/pages/MembershipPlansPage.tsx": "Renders membership plans, group sessions, and steam session benefits using pricing cards and feature lists.",
  "frontend/src/pages/OnlineAdmissionPage.tsx": "Shows an online admission form and a success screen after submission with navigation options.",
  "frontend/src/pages/RestaurantCoffeePage.tsx": "Presents restaurant and coffee offerings with a feature grid and a placeholder gallery.",
  "frontend/src/utils/urlParams.ts": "Utility module for reading, storing, and clearing URL and session parameters, including hash-based parsing.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, fonts, animations, and layout settings with custom gold theme styling.",
  "project_state.json": "Holds the project’s versioned state, including site concept summary, architectural notes, unresolved issues, and a list of existing implemented features. Used to track requirements, design decisions, and pending fixes for the UBW luxury fitness website."
}